SEIUNSKAI/stm32-/软件I2C读写MPU6050/Hardware/myI2C.c
#include "stm32f10x.h"  
#include "Delay.h"

#define SCL_PORT    GPIOB
#define SCL_PIN     GPIO_Pin_10

void myI2C_W_SCL(uint8_t BitValue)
{
    GPIO_WriteBit(GPIOB, GPIO_Pin_10, (BitAction)BitValue);
    Delay_us(10);
}

void myI2C_W_SDA(uint8_t BitValue)
{
    GPIO_WriteBit(GPIOB, GPIO_Pin_11, (BitAction)BitValue);
    Delay_us(10);
}

uint8_t myI2C_R_SDA(void)
{
    uint8_t BitValue;
    BitValue = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_11);
    Delay_us(10);
    return BitValue;
}

void myI2C_Init(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

    GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	GPIO_SetBits(GPIOB, GPIO_Pin_10 | GPIO_Pin_11);
}


void myI2C_Start(void)
{
    myI2C_W_SDA(1);
    myI2C_W_SCL(1);   
    myI2C_W_SDA(0);
    myI2C_W_SCL(0);
}

void myI2C_Stop(void)
{
    myI2C_W_SDA(0);
    myI2C_W_SCL(1); 
    myI2C_W_SDA(1);
}

void myI2C_SendByte(uint8_t Byte)
{
    uint8_t i;
    
    for(i = 0; i < 8; i ++)
    {
        myI2C_W_SDA(Byte & 0x80 >> i);
        myI2C_W_SCL(1); 
        myI2C_W_SCL(0); 
    }
}

uint8_t myI2C_RecieveByte(void)
{
    uint8_t i, Byte = 0x00;
    myI2C_W_SDA(1);
    for(i = 0; i < 8; i ++)
    {
        myI2C_W_SCL(1);
        if(myI2C_R_SDA() == 1){Byte |= (0x80 >> i);}
        myI2C_W_SCL(0);
    }
    return Byte;
}

void myI2C_SendAck(uint8_t Ackbit)
{
    myI2C_W_SDA(Ackbit);
    myI2C_W_SCL(1); 
    myI2C_W_SCL(0); 
}

uint8_t myI2C_RecieveAck(void)
{   
    uint8_t Ackbit;
    myI2C_W_SDA(1);
    myI2C_W_SCL(1);
    Ackbit = myI2C_R_SDA();
    myI2C_W_SCL(0);
    return Ackbit;
}